{
    "projects": [{
        "title":"Order-Manager",
        "description": "Frontend part of a full-stack web application that offers a user-friendly interface to manage an online store's orders. Includes caching, REST API, incorporates CRUD operations from backend. ",
        "techStack": ["TypeScript", "React", "Keycloak"]
    }, {
        "title":"Order-Manager-Backend",
        "description": "RESTful API developed with Spring Boot and JPA, that realizes order-management via CRUD operations. ",
        "techStack": ["Java", "Spring Boot", "MySQL", "JPA", "Hibernate"]
    },{
        "title":"Personal-Finance-Tracker-Frontend",
        "description": "Frontend of a web application where users can track their income and expenses, view their financial situation through charts, and even automatically import their transactions via bank API integration. ",
        "techStack": ["TypeScript", "Next.js"]
    },{
        "title":"Personal-Finance-Tracker-Backend",
        "description": "Backend of web application where users can track their income and expenses, view their financial situation through charts, and even automatically import their transactions via bank API integration. ",
        "techStack": ["JavaScript", "Nest.js", "PostgreSQL"]
    },{
        "title":"Online-Library",
        "description": "Library webapp.",
        "techStack": ["Node.js", "Express"]
    },{
        "title":"SQUEAL-MiniDBMS",
        "description": "The Database Management System (DBMS) project is a Java-based application that provides essential functionalities for managing databases and tables. ",
        "techStack": ["Java", "Swing", "MongoDB"]
    },{
        "title":"Snake-Extra",
        "description": "This projects contains the implementation of the old-school snake mobile game, but , of course spiced with numerous features. ",
        "techStack": ["Java", "Swing"]
    },{
        "title":"OpenGL-Project",
        "description": "A man shaped object moves around the map, collecting pulsating flowers (which are randomly spread on the map), while dodging deadly axes. ",
        "techStack": ["C#", ".NET"]
    }]
}